TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Port.h
/*
 * TEXAS INSTRUMENTS TEXT FILE LICENSE
 *
 * Copyright (c) 2022-2025 Texas Instruments Incorporated
 *
 * All rights reserved not granted herein.
 *
 * Limited License.
 *
 * Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
 * license under copyrights and patents it now or hereafter owns or controls to
 * make, have made, use, import, offer to sell and sell ("Utilize") this software
 * subject to the terms herein. With respect to the foregoing patent license,
 * such license is granted solely to the extent that any such patent is necessary
 * to Utilize the software alone. The patent license shall not apply to any
 * combinations which include this software, other than combinations with devices
 * manufactured by or for TI ("TI Devices"). No hardware patent is licensed hereunder.
 *
 * Redistributions must preserve existing copyright notices and reproduce this license
 * (including the above copyright notice and the disclaimer and (if applicable) source
 * code license limitations below) in the documentation and/or other materials provided
 * with the distribution.
 *
 * Redistribution and use in binary form, without modification, are permitted provided
 * that the following conditions are met:
 * No reverse engineering, decompilation, or disassembly of this software is
 * permitted with respect to any software provided in binary form.
 * Any redistribution and use are licensed by TI for use only with TI Devices.
 * Nothing shall obligate TI to provide you with source code for the software
 * licensed and provided to you in object code.
 *
 * If software source code is provided to you, modification and redistribution of the
 * source code are permitted provided that the following conditions are met:
 * Any redistribution and use of the source code, including any resulting derivative
 * works, are licensed by TI for use only with TI Devices.
 * Any redistribution and use of any object code compiled from the source code
 * and any resulting derivative works, are licensed by TI for use only with TI Devices.
 *
 * Neither the name of Texas Instruments Incorporated nor the names of its suppliers
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * DISCLAIMER.
 *
 * THIS SOFTWARE IS PROVIDED BY TI AND TI'S LICENSORS "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL TI AND TI'S
 * LICENSORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**
 *   \file  Hw_Cpsw_Port.h
 *
 *   \brief
 *      register-level header file for CPSW.
 *
 */

#ifndef HW_CPSW_PORT_H_
#define HW_CPSW_PORT_H_

#ifdef __cplusplus
extern "C"
{
#endif


/*!*****************************************************************************
* Register Definitions
*******************************************************************************/

#define CPSW_CPPI_P0_CONTROL_REG                         (0x00021004U)
#define CPSW_CPPI_P0_FLOW_ID_OFFSET_REG                  (0x00021008U)
#define CPSW_CPPI_P0_BLK_CNT_REG                         (0x00021010U)
#define CPSW_CPPI_P0_PORT_VLAN_REG                       (0x00021014U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG                      (0x00021018U)
#define CPSW_CPPI_P0_PRI_CTL_REG                         (0x0002101CU)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG                      (0x00021020U)
#define CPSW_CPPI_P0_RX_MAXLEN_REG                       (0x00021024U)
#define CPSW_CPPI_P0_TX_BLKS_PRI_REG                     (0x00021028U)
#define CPSW_CPPI_P0_IDLE2LPI_REG                        (0x00021030U)
#define CPSW_CPPI_P0_LPI2WAKE_REG                        (0x00021034U)
#define CPSW_CPPI_P0_EEE_STATUS_REG                      (0x00021038U)
#define CPSW_CPPI_P0_RX_PKTS_PRI_REG                     (0x0002103CU)
#define CPSW_CPPI_P0_RX_GAP_REG                          (0x0002104CU)
#define CPSW_CPPI_P0_FIFO_STATUS_REG                     (0x00021050U)
#define CPSW_CPPI_P0_RX_DSCP_MAP_REG(P0_RX_DSCP_MAP_REG) (0x00021120U+((P0_RX_DSCP_MAP_REG)*0x4U))
#define CPSW_CPPI_P0_PRI_CIR_REG(P0_PRI_CIR_REG)         (0x00021140U+((P0_PRI_CIR_REG)*0x4U))
#define CPSW_CPPI_P0_PRI_EIR_REG(P0_PRI_EIR_REG)         (0x00021160U+((P0_PRI_EIR_REG)*0x4U))
#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG               (0x00021180U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG               (0x00021184U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG               (0x00021188U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG               (0x0002118CU)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG           (0x00021190U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG           (0x00021194U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG           (0x00021198U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG           (0x0002119CU)
#define CPSW_CPPI_P0_SRC_ID_A_REG                        (0x00021300U)
#define CPSW_CPPI_P0_SRC_ID_B_REG                        (0x00021304U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG                   (0x00021320U)
#define CPSW_ETH_PN_RESERVED_REG                         (0x00022000U)
#define CPSW_ETH_PN_CONTROL_REG                          (0x00022004U)
#define CPSW_ETH_PN_MAX_BLKS_REG                         (0x00022008U)
#define CPSW_ETH_PN_BLK_CNT_REG                          (0x00022010U)
#define CPSW_ETH_PN_PORT_VLAN_REG                        (0x00022014U)
#define CPSW_ETH_PN_TX_PRI_MAP_REG                       (0x00022018U)
#define CPSW_ETH_PN_PRI_CTL_REG                          (0x0002201CU)
#define CPSW_ETH_PN_RX_PRI_MAP_REG                       (0x00022020U)
#define CPSW_ETH_PN_RX_MAXLEN_REG                        (0x00022024U)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG                      (0x00022028U)
#define CPSW_ETH_PN_RX_FLOW_THRESH_REG                   (0x0002202CU)
#define CPSW_ETH_PN_IDLE2LPI_REG                         (0x00022030U)
#define CPSW_ETH_PN_LPI2WAKE_REG                         (0x00022034U)
#define CPSW_ETH_PN_EEE_STATUS_REG                       (0x00022038U)
#define CPSW_ETH_PN_FIFO_STATUS_REG                      (0x00022050U)
#define CPSW_ETH_PN_EST_CONTROL_REG                      (0x00022060U)
#define CPSW_ETH_PN_RX_DSCP_MAP_REG(PN_RX_DSCP_MAP_REG)  (0x00022120U+((PN_RX_DSCP_MAP_REG)*0x4U))
#define CPSW_ETH_PN_PRI_CIR_REG(PN_PRI_CIR_REG)          (0x00022140U+((PN_PRI_CIR_REG)*0x4U))
#define CPSW_ETH_PN_PRI_EIR_REG(PN_PRI_EIR_REG)          (0x00022160U+((PN_PRI_EIR_REG)*0x4U))
#define CPSW_ETH_PN_TX_D_THRESH_SET_L_REG                (0x00022180U)
#define CPSW_ETH_PN_TX_D_THRESH_SET_H_REG                (0x00022184U)
#define CPSW_ETH_PN_TX_D_THRESH_CLR_L_REG                (0x00022188U)
#define CPSW_ETH_PN_TX_D_THRESH_CLR_H_REG                (0x0002218CU)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_L_REG            (0x00022190U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_H_REG            (0x00022194U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG            (0x00022198U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG            (0x0002219CU)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG              (0x00022300U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG              (0x00022304U)
#define CPSW_ETH_PN_SA_L_REG                             (0x00022308U)
#define CPSW_ETH_PN_SA_H_REG                             (0x0002230CU)
#define CPSW_ETH_PN_TS_CTL_REG                           (0x00022310U)
#define CPSW_ETH_PN_TS_SEQ_LTYPE_REG                     (0x00022314U)
#define CPSW_ETH_PN_TS_VLAN_LTYPE_REG                    (0x00022318U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG                    (0x0002231CU)
#define CPSW_ETH_PN_TS_CTL2_REG                          (0x00022320U)
#define CPSW_ETH_PN_MAC_CONTROL_REG                      (0x00022330U)
#define CPSW_ETH_PN_MAC_STATUS_REG                       (0x00022334U)
#define CPSW_ETH_PN_MAC_SOFT_RESET_REG                   (0x00022338U)
#define CPSW_ETH_PN_MAC_BOFFTEST_REG                     (0x0002233CU)
#define CPSW_ETH_PN_MAC_RX_PAUSETIMER_REG                (0x00022340U)
#define CPSW_ETH_PN_MAC_RXN_PAUSETIMER_REG(PN_MAC_RXN_PAUSETIMER_REG) (0x00022350U+((PN_MAC_RXN_PAUSETIMER_REG)*0x4U))
#define CPSW_ETH_PN_MAC_TX_PAUSETIMER_REG                (0x00022370U)
#define CPSW_ETH_PN_MAC_TXN_PAUSETIMER_REG(PN_MAC_TXN_PAUSETIMER_REG) (0x00022380U+((PN_MAC_TXN_PAUSETIMER_REG)*0x4U))
#define CPSW_ETH_PN_MAC_EMCONTROL_REG                    (0x000223A0U)
#define CPSW_ETH_PN_MAC_TX_GAP_REG                       (0x000223A4U)
#define CPSW_PN_OFFSET(n)                               ((((uint32)(n))*0x1000U) - (uint32)0x1000U)

/*!*****************************************************************************
* Field Definition Macros
*******************************************************************************/

/*!************************************** CPSW_P0_CONTROL *********************/

/* P0_CONTROL_REG */

#define CPSW_CPPI_P0_CONTROL_REG_RX_CHECKSUM_EN_MASK     (0x00000001U)
#define CPSW_CPPI_P0_CONTROL_REG_RX_CHECKSUM_EN_SHIFT    (0x00000000U)
#define CPSW_CPPI_P0_CONTROL_REG_RX_CHECKSUM_EN_MAX      (0x00000001U)

#define CPSW_CPPI_P0_CONTROL_REG_DSCP_IPV4_EN_MASK       (0x00000002U)
#define CPSW_CPPI_P0_CONTROL_REG_DSCP_IPV4_EN_SHIFT      (0x00000001U)
#define CPSW_CPPI_P0_CONTROL_REG_DSCP_IPV4_EN_MAX        (0x00000001U)

#define CPSW_CPPI_P0_CONTROL_REG_DSCP_IPV6_EN_MASK       (0x00000004U)
#define CPSW_CPPI_P0_CONTROL_REG_DSCP_IPV6_EN_SHIFT      (0x00000002U)
#define CPSW_CPPI_P0_CONTROL_REG_DSCP_IPV6_EN_MAX        (0x00000001U)

