TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Port.h
#define CPSW_CPPI_P0_CONTROL_REG_TX_CHECKSUM_EN_MASK     (0x00000008U)
#define CPSW_CPPI_P0_CONTROL_REG_TX_CHECKSUM_EN_SHIFT    (0x00000003U)
#define CPSW_CPPI_P0_CONTROL_REG_TX_CHECKSUM_EN_MAX      (0x00000001U)

#define CPSW_CPPI_P0_CONTROL_REG_TX_ECC_ERR_EN_MASK      (0x00004000U)
#define CPSW_CPPI_P0_CONTROL_REG_TX_ECC_ERR_EN_SHIFT     (0x0000000EU)
#define CPSW_CPPI_P0_CONTROL_REG_TX_ECC_ERR_EN_MAX       (0x00000001U)

#define CPSW_CPPI_P0_CONTROL_REG_RX_ECC_ERR_EN_MASK      (0x00008000U)
#define CPSW_CPPI_P0_CONTROL_REG_RX_ECC_ERR_EN_SHIFT     (0x0000000FU)
#define CPSW_CPPI_P0_CONTROL_REG_RX_ECC_ERR_EN_MAX       (0x00000001U)

#define CPSW_CPPI_P0_CONTROL_REG_RX_REMAP_VLAN_MASK      (0x00010000U)
#define CPSW_CPPI_P0_CONTROL_REG_RX_REMAP_VLAN_SHIFT     (0x00000010U)
#define CPSW_CPPI_P0_CONTROL_REG_RX_REMAP_VLAN_MAX       (0x00000001U)

#define CPSW_CPPI_P0_CONTROL_REG_RX_REMAP_DSCP_V4_MASK   (0x00020000U)
#define CPSW_CPPI_P0_CONTROL_REG_RX_REMAP_DSCP_V4_SHIFT  (0x00000011U)
#define CPSW_CPPI_P0_CONTROL_REG_RX_REMAP_DSCP_V4_MAX    (0x00000001U)

#define CPSW_CPPI_P0_CONTROL_REG_RX_REMAP_DSCP_V6_MASK   (0x00040000U)
#define CPSW_CPPI_P0_CONTROL_REG_RX_REMAP_DSCP_V6_SHIFT  (0x00000012U)
#define CPSW_CPPI_P0_CONTROL_REG_RX_REMAP_DSCP_V6_MAX    (0x00000001U)

/* P0_FLOW_ID_OFFSET_REG */

#define CPSW_CPPI_P0_FLOW_ID_OFFSET_REG_VALUE_MASK       (0x00003FFFU)
#define CPSW_CPPI_P0_FLOW_ID_OFFSET_REG_VALUE_SHIFT      (0x00000000U)
#define CPSW_CPPI_P0_FLOW_ID_OFFSET_REG_VALUE_MAX        (0x00003FFFU)

/* P0_BLK_CNT_REG */

#define CPSW_CPPI_P0_BLK_CNT_REG_RX_BLK_CNT_MASK         (0x0000003FU)
#define CPSW_CPPI_P0_BLK_CNT_REG_RX_BLK_CNT_SHIFT        (0x00000000U)
#define CPSW_CPPI_P0_BLK_CNT_REG_RX_BLK_CNT_MAX          (0x0000003FU)

#define CPSW_CPPI_P0_BLK_CNT_REG_TX_BLK_CNT_MASK         (0x00001F00U)
#define CPSW_CPPI_P0_BLK_CNT_REG_TX_BLK_CNT_SHIFT        (0x00000008U)
#define CPSW_CPPI_P0_BLK_CNT_REG_TX_BLK_CNT_MAX          (0x0000001FU)

/* P0_PORT_VLAN_REG */

#define CPSW_CPPI_P0_PORT_VLAN_REG_PORT_VID_MASK         (0x00000FFFU)
#define CPSW_CPPI_P0_PORT_VLAN_REG_PORT_VID_SHIFT        (0x00000000U)
#define CPSW_CPPI_P0_PORT_VLAN_REG_PORT_VID_MAX          (0x00000FFFU)

#define CPSW_CPPI_P0_PORT_VLAN_REG_PORT_CFI_MASK         (0x00001000U)
#define CPSW_CPPI_P0_PORT_VLAN_REG_PORT_CFI_SHIFT        (0x0000000CU)
#define CPSW_CPPI_P0_PORT_VLAN_REG_PORT_CFI_MAX          (0x00000001U)

#define CPSW_CPPI_P0_PORT_VLAN_REG_PORT_PRI_MASK         (0x0000E000U)
#define CPSW_CPPI_P0_PORT_VLAN_REG_PORT_PRI_SHIFT        (0x0000000DU)
#define CPSW_CPPI_P0_PORT_VLAN_REG_PORT_PRI_MAX          (0x00000007U)

/* P0_TX_PRI_MAP_REG */

#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI0_MASK            (0x00000007U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI0_SHIFT           (0x00000000U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI0_MAX             (0x00000007U)

#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI1_MASK            (0x00000070U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI1_SHIFT           (0x00000004U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI1_MAX             (0x00000007U)

#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI2_MASK            (0x00000700U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI2_SHIFT           (0x00000008U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI2_MAX             (0x00000007U)

#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI3_MASK            (0x00007000U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI3_SHIFT           (0x0000000CU)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI3_MAX             (0x00000007U)

#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI4_MASK            (0x00070000U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI4_SHIFT           (0x00000010U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI4_MAX             (0x00000007U)

#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI5_MASK            (0x00700000U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI5_SHIFT           (0x00000014U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI5_MAX             (0x00000007U)

#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI6_MASK            (0x07000000U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI6_SHIFT           (0x00000018U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI6_MAX             (0x00000007U)

#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI7_MASK            (0x70000000U)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI7_SHIFT           (0x0000001CU)
#define CPSW_CPPI_P0_TX_PRI_MAP_REG_PRI7_MAX             (0x00000007U)

/* P0_PRI_CTL_REG */

#define CPSW_CPPI_P0_PRI_CTL_REG_RX_PTYPE_MASK           (0x00000100U)
#define CPSW_CPPI_P0_PRI_CTL_REG_RX_PTYPE_SHIFT          (0x00000008U)
#define CPSW_CPPI_P0_PRI_CTL_REG_RX_PTYPE_MAX            (0x00000001U)

#define CPSW_CPPI_P0_PRI_CTL_REG_RX_FLOW_PRI_MASK        (0x00FF0000U)
#define CPSW_CPPI_P0_PRI_CTL_REG_RX_FLOW_PRI_SHIFT       (0x00000010U)
#define CPSW_CPPI_P0_PRI_CTL_REG_RX_FLOW_PRI_MAX         (0x000000FFU)

/* P0_RX_PRI_MAP_REG */

#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI0_MASK            (0x00000007U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI0_SHIFT           (0x00000000U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI0_MAX             (0x00000007U)

#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI1_MASK            (0x00000070U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI1_SHIFT           (0x00000004U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI1_MAX             (0x00000007U)

#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI2_MASK            (0x00000700U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI2_SHIFT           (0x00000008U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI2_MAX             (0x00000007U)

#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI3_MASK            (0x00007000U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI3_SHIFT           (0x0000000CU)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI3_MAX             (0x00000007U)

#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI4_MASK            (0x00070000U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI4_SHIFT           (0x00000010U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI4_MAX             (0x00000007U)

#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI5_MASK            (0x00700000U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI5_SHIFT           (0x00000014U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI5_MAX             (0x00000007U)

#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI6_MASK            (0x07000000U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI6_SHIFT           (0x00000018U)
#define CPSW_CPPI_P0_RX_PRI_MAP_REG_PRI6_MAX             (0x00000007U)

