TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Port.h
#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_H_REG_PRI5_MASK  (0x00001F00U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_H_REG_PRI5_SHIFT (0x00000008U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_H_REG_PRI5_MAX   (0x0000001FU)

#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_H_REG_PRI6_MASK  (0x001F0000U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_H_REG_PRI6_SHIFT (0x00000010U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_H_REG_PRI6_MAX   (0x0000001FU)

#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_H_REG_PRI7_MASK  (0x1F000000U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_H_REG_PRI7_SHIFT (0x00000018U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_SET_H_REG_PRI7_MAX   (0x0000001FU)

/* PN_TX_G_BUF_THRESH_CLR_L_REG */

#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI0_MASK  (0x0000001FU)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI0_SHIFT (0x00000000U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI0_MAX   (0x0000001FU)

#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI1_MASK  (0x00001F00U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI1_SHIFT (0x00000008U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI1_MAX   (0x0000001FU)

#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI2_MASK  (0x001F0000U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI2_SHIFT (0x00000010U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI2_MAX   (0x0000001FU)

#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI3_MASK  (0x1F000000U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI3_SHIFT (0x00000018U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_L_REG_PRI3_MAX   (0x0000001FU)

/* PN_TX_G_BUF_THRESH_CLR_H_REG */

#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI4_MASK  (0x0000001FU)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI4_SHIFT (0x00000000U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI4_MAX   (0x0000001FU)

#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI5_MASK  (0x00001F00U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI5_SHIFT (0x00000008U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI5_MAX   (0x0000001FU)

#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI6_MASK  (0x001F0000U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI6_SHIFT (0x00000010U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI6_MAX   (0x0000001FU)

#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI7_MASK  (0x1F000000U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI7_SHIFT (0x00000018U)
#define CPSW_ETH_PN_TX_G_BUF_THRESH_CLR_H_REG_PRI7_MAX   (0x0000001FU)

/* PN_TX_D_OFLOW_ADDVAL_L_REG */

#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI0_MASK    (0x0000001FU)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI0_SHIFT   (0x00000000U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI0_MAX     (0x0000001FU)

#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI1_MASK    (0x00001F00U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI1_SHIFT   (0x00000008U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI1_MAX     (0x0000001FU)

#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI2_MASK    (0x001F0000U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI2_SHIFT   (0x00000010U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI2_MAX     (0x0000001FU)

#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI3_MASK    (0x1F000000U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI3_SHIFT   (0x00000018U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_L_REG_PRI3_MAX     (0x0000001FU)

/* PN_TX_D_OFLOW_ADDVAL_H_REG */

#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI4_MASK    (0x0000001FU)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI4_SHIFT   (0x00000000U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI4_MAX     (0x0000001FU)

#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI5_MASK    (0x00001F00U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI5_SHIFT   (0x00000008U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI5_MAX     (0x0000001FU)

#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI6_MASK    (0x001F0000U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI6_SHIFT   (0x00000010U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI6_MAX     (0x0000001FU)

#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI7_MASK    (0x1F000000U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI7_SHIFT   (0x00000018U)
#define CPSW_ETH_PN_TX_D_OFLOW_ADDVAL_H_REG_PRI7_MAX     (0x0000001FU)

/* PN_SA_L_REG */

#define CPSW_ETH_PN_SA_L_REG_MACSRCADDR_15_8_MASK        (0x000000FFU)
#define CPSW_ETH_PN_SA_L_REG_MACSRCADDR_15_8_SHIFT       (0x00000000U)
#define CPSW_ETH_PN_SA_L_REG_MACSRCADDR_15_8_MAX         (0x000000FFU)

#define CPSW_ETH_PN_SA_L_REG_MACSRCADDR_7_0_MASK         (0x0000FF00U)
#define CPSW_ETH_PN_SA_L_REG_MACSRCADDR_7_0_SHIFT        (0x00000008U)
#define CPSW_ETH_PN_SA_L_REG_MACSRCADDR_7_0_MAX          (0x000000FFU)

/* PN_SA_H_REG */

#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_47_40_MASK       (0x000000FFU)
#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_47_40_SHIFT      (0x00000000U)
#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_47_40_MAX        (0x000000FFU)

#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_39_32_MASK       (0x0000FF00U)
#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_39_32_SHIFT      (0x00000008U)
#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_39_32_MAX        (0x000000FFU)

#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_31_24_MASK       (0x00FF0000U)
#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_31_24_SHIFT      (0x00000010U)
#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_31_24_MAX        (0x000000FFU)

#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_23_16_MASK       (0xFF000000U)
#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_23_16_SHIFT      (0x00000018U)
#define CPSW_ETH_PN_SA_H_REG_MACSRCADDR_23_16_MAX        (0x000000FFU)

/* PN_TS_CTL_REG */

#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_ANNEX_F_EN_MASK     (0x00000001U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_ANNEX_F_EN_SHIFT    (0x00000000U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_ANNEX_F_EN_MAX      (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_VLAN_LTYPE1_EN_MASK (0x00000002U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_VLAN_LTYPE1_EN_SHIFT (0x00000001U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_VLAN_LTYPE1_EN_MAX  (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_VLAN_LTYPE2_EN_MASK (0x00000004U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_VLAN_LTYPE2_EN_SHIFT (0x00000002U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_VLAN_LTYPE2_EN_MAX  (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_ANNEX_D_EN_MASK     (0x00000008U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_ANNEX_D_EN_SHIFT    (0x00000003U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_ANNEX_D_EN_MAX      (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_ANNEX_F_EN_MASK     (0x00000010U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_ANNEX_F_EN_SHIFT    (0x00000004U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_ANNEX_F_EN_MAX      (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_VLAN_LTYPE1_EN_MASK (0x00000020U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_VLAN_LTYPE1_EN_SHIFT (0x00000005U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_VLAN_LTYPE1_EN_MAX  (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_VLAN_LTYPE2_EN_MASK (0x00000040U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_VLAN_LTYPE2_EN_SHIFT (0x00000006U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_VLAN_LTYPE2_EN_MAX  (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_ANNEX_D_EN_MASK     (0x00000080U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_ANNEX_D_EN_SHIFT    (0x00000007U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_ANNEX_D_EN_MAX      (0x00000001U)

