TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Port.h
#define CPSW_ETH_PN_MAC_BOFFTEST_REG_PACEVAL_MASK        (0x7C000000U)
#define CPSW_ETH_PN_MAC_BOFFTEST_REG_PACEVAL_SHIFT       (0x0000001AU)
#define CPSW_ETH_PN_MAC_BOFFTEST_REG_PACEVAL_MAX         (0x0000001FU)

/* PN_MAC_RX_PAUSETIMER_REG */

#define CPSW_ETH_PN_MAC_RX_PAUSETIMER_REG_RX_PAUSETIMER_MASK (0x0000FFFFU)
#define CPSW_ETH_PN_MAC_RX_PAUSETIMER_REG_RX_PAUSETIMER_SHIFT (0x00000000U)
#define CPSW_ETH_PN_MAC_RX_PAUSETIMER_REG_RX_PAUSETIMER_MAX (0x0000FFFFU)

/* PN_MAC_RXN_PAUSETIMER_REG */

#define CPSW_ETH_PN_MAC_RXN_PAUSETIMER_REG_RX_PAUSETIMER_MASK (0x0000FFFFU)
#define CPSW_ETH_PN_MAC_RXN_PAUSETIMER_REG_RX_PAUSETIMER_SHIFT (0x00000000U)
#define CPSW_ETH_PN_MAC_RXN_PAUSETIMER_REG_RX_PAUSETIMER_MAX (0x0000FFFFU)

/* PN_MAC_TX_PAUSETIMER_REG */

#define CPSW_ETH_PN_MAC_TX_PAUSETIMER_REG_TX_PAUSETIMER_MASK (0x0000FFFFU)
#define CPSW_ETH_PN_MAC_TX_PAUSETIMER_REG_TX_PAUSETIMER_SHIFT (0x00000000U)
#define CPSW_ETH_PN_MAC_TX_PAUSETIMER_REG_TX_PAUSETIMER_MAX (0x0000FFFFU)

/* PN_MAC_TXN_PAUSETIMER_REG */

#define CPSW_ETH_PN_MAC_TXN_PAUSETIMER_REG_TX_PAUSETIMER_MASK (0x0000FFFFU)
#define CPSW_ETH_PN_MAC_TXN_PAUSETIMER_REG_TX_PAUSETIMER_SHIFT (0x00000000U)
#define CPSW_ETH_PN_MAC_TXN_PAUSETIMER_REG_TX_PAUSETIMER_MAX (0x0000FFFFU)

/* PN_MAC_EMCONTROL_REG */

#define CPSW_ETH_PN_MAC_EMCONTROL_REG_FREE_MASK          (0x00000001U)
#define CPSW_ETH_PN_MAC_EMCONTROL_REG_FREE_SHIFT         (0x00000000U)
#define CPSW_ETH_PN_MAC_EMCONTROL_REG_FREE_MAX           (0x00000001U)

#define CPSW_ETH_PN_MAC_EMCONTROL_REG_SOFT_MASK          (0x00000002U)
#define CPSW_ETH_PN_MAC_EMCONTROL_REG_SOFT_SHIFT         (0x00000001U)
#define CPSW_ETH_PN_MAC_EMCONTROL_REG_SOFT_MAX           (0x00000001U)

/* PN_MAC_TX_GAP_REG */

#define CPSW_ETH_PN_MAC_TX_GAP_REG_TX_GAP_MASK           (0x0000FFFFU)
#define CPSW_ETH_PN_MAC_TX_GAP_REG_TX_GAP_SHIFT          (0x00000000U)
#define CPSW_ETH_PN_MAC_TX_GAP_REG_TX_GAP_MAX            (0x0000FFFFU)


/*!*****************************************************************************
* End of File
*******************************************************************************/
#ifdef __cplusplus
}
#endif

#endif  /* _HW_CPSW_PORT_H_ */
